#include "header.h"
#include <assert.h>

int main() {
    // нагрузочное тестирование
    ten_thousand_test(true);  // много процессов
    ten_thousand_test(false);  // один процесс
    /*   В обоих режимах по пять раз запустил программу и посчитал среднее арифметическое.
    Однопроцессная программа отрабатывала в среднем за 0,004228с, а 6 процессов - за 0,002318с
    То есть почти в два раза быстрее.
    Предполагаю, что если бы количество рассчетов сильно увеличилось, прирост был бы намного заметнее.
    Так как в нашем случае относительно много времени ушло на порождение дочерних процессов */

    int k = 5;

    assert(run_app() == 0);

    return 0;
}


